package com.fruitable.Fruitable.app.presentation.data

val agreeBody1 = mapOf(
    "제1조 (목적) " to """
        이 약관은 푸릇에이블(이하 “회사”라 합니다)이 모바일 기기를 통해 제공하는 서비스의 이용에 대한 회사와 서비스 이용자의 권리ㆍ의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로 합니다.
    """.trimIndent(),

    "제2조 (용어의 정의)\n" to """① 이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
   1. “회사”라 함은 모바일 기기를 통하여 서비스를 제공하는 사업자를 의미합니다.
   2. “회원”이란 이 약관에 따라 이용계약을 체결하고, 회사가 제공하는 서비스를 이용하는 자를 의미합니다.
   3. “모바일 기기”란 콘텐츠를 다운로드 받거나 설치하여 사용할 수 있는 기기로서, 휴대폰, 스마트폰, 휴대정보단말기(PDA), 태블릿 등을 의미합니다. 
   4. “계정정보”란 회원의 닉네임, 프로필 사진, 성명, 이메일과 같은 회원이 회사에 제공한 정보를 통칭합니다.
   5. “애플리케이션”이란 회사가 제공하는 서비스를 이용하기 위하여 모바일 기기를 통해 다운로드 받거나 설치하여 사용하는 프로그램 일체를 의미합니다.

② 이 약관에서 사용하는 용어의 정의는 본 조 제1항에서 정하는 것을 제외하고는 관계법령 및 서비스별 정책에서 정하는 바에 의하며, 이에 정하지 아니한 것은 일반적인 상 관례에 따릅니다.
    """.trimIndent(),

    "제3조 (회사정보 등의 제공) " to """회사는 다음 각 호의 사항을 회원이 알아보기 쉽도록 연결화면을 통하여 볼 수 있도록 할 수 있습니다.
 1. 개인정보처리방침 
 2. 서비스 이용약관 
    """.trimIndent(),

    "제4조 (약관의 효력 및 변경)\n" to """
        ① 회사가 약관을 개정할 경우 개정약관 공지 후 개정약관의 적용에 대한 회원의 동의 여부를 확인합니다. 회사는 제2항의 공지 또는 통지를 할 경우 회원이 개정약관에 대해 동의 또는 거부의 의사표시를 하지 않으면 동의한 것으로 볼 수 있다는 내용도 함께 공지 또는 통지를 하며, 회원이 이 약관 시행일까지 거부의 의사표시를 하지 않는다면 개정약관에 동의한 것으로 볼 수 있습니다. 회원이 개정약관에 대해 동의하지 않는 경우 회사 또는 회원은 서비스 이용계약을 해지할 수 있습니다. 
       
        ② 회사는 「약관의 규제에 관한 법률」,「정보통신망이용촉진 및 정보보호 등에 관한 법률」 등 관련 법령에 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.
    """.trimIndent()
)

val agreeBody2 = mapOf(
    "제5조 (개인정보의 보호 및 사용)\n" to """
        ① 회사는 관련 법령이 정하는 바에 따라 회원의 개인정보를 보호하기 위해 노력하며, 개인정보의 보호 및 사용에 대해서는 관련 법령 및 회사의 개인정보처리방침에 따릅니다. 다만, 회사가 제공하는 서비스 이외의 링크된 서비스에서는 회사의 개인정보처리방침이 적용되지 않습니다.
      
        ② 회사는 관련 법령에 의해 관련 국가기관 등의 요청이 있는 경우를 제외하고는 회원의 개인정보를 본인의 동의 없이 타인에게 제공하지 않습니다.
        ③ 회사는 회원의 귀책사유로 개인정보가 유출되어 발생한 피해에 대하여 책임을 지지 않습니다.
    """.trimIndent()
)
val agreeBody3 = mapOf(
    "제6조 (회사의 의무)\n" to """① 회사는 관련 법령, 이 약관에서 정하는 권리의 행사 및 의무의 이행을 신의에 따라 성실하게 준수합니다.

② 회사는 회원이 안전하게 서비스를 이용할 수 있도록 개인정보(신용정보 포함)보호를 위해 보안시스템을 갖추어야 하며 개인정보처리방침을 공시하고 준수합니다. 회사는 이 약관 및 개인정보처리방침에서 정한 경우를 제외하고는 회원의 개인정보가 제3자에게 공개 또는 제공되지 않도록 합니다. 

③ 회사는 계속적이고 안정적인 서비스의 제공을 위하여 서비스 개선을 하던 중 설비에 장애가 생기거나 데이터 등이 멸실․훼손된 때에는 천재지변, 비상사태, 현재의 기술로는 해결이 불가능한 장애나 결함 등 부득이한 사유가 없는 한 지체 없이 이를 수리 또는 복구하도록 최선의 노력을 다합니다.
    """.trimIndent(),
    "제7조 (회원의 의무)\n" to """
        ① 회원은 회사에서 제공하는 서비스의 이용과 관련하여 다음 각 호에 해당하는 행위를 해서는 안 됩니다.
         1. 이용신청 또는 회원 정보 변경 시 허위사실을 기재하는 행위
        ② 회원의 계정 및 모바일 기기에 관한 관리 책임은 회원에게 있으며, 이를 타인이 이용하도록 하게 하여서는 안 됩니다. 모바일 기기의 관리 부실이나 타인에게 이용을 승낙함으로 인해 발생하는 손해에 대해서 회사는 책임을 지지 않습니다. 
    """.trimIndent()
)
val agreeBody4 = mapOf(
    "제8조 (서비스의 제공)\n" to """① 회사는 제5조의 규정에 따라 이용계약이 완료된 회원에게 그 즉시 서비스를 이용할 수 있도록 합니다. 
    """.trimIndent(),
    "제9조 (서비스의 변경 및 중단)\n" to """
        ① 회사는 원활한 서비스 제공을 위해 운영상 또는 기술상의 필요에 따라 서비스를 변경할 수 있으며, 변경 전에 해당 내용을 서비스 내에 공지합니다. 다만, 버그․오류 등의 수정이나 긴급 업데이트 등 부득이하게 변경할 필요가 있는 경우 또는 중대한 변경에 해당하지 않는 경우에는 사후에 공지할 수 있습니다.
        
        ② 회사는 영업양도․분할․합병 등에 따른 영업의 폐지, 당해 서비스의 현저한 수익 악화 등 경영상의 중대한 사유로 인해 게임서비스를 지속하기 어려운 경우에는 서비스 전부를 중단할 수 있습니다..
    """.trimIndent(),
    "제10조 (정보의 수집 등)\n" to """
        ① 회사는 회원간의 분쟁 조정, 민원 처리를 위한 경우에 한하여, 제3자는 법령에 따라 권한이 부여된 경우에 한하여 이 정보를 열람할 수 있습니다. 
      
        ② 회사는 서비스의 원활하고 안정적인 운영 및 서비스 품질의 개선을 위하여 회원의 개인정보를 제외한 회원의 모바일 기기 정보(설정,사양,운영체제, 버전 등)를 수집 ‧ 활용할 수 있습니다.
    """.trimIndent(),
    "제11조 (회원에 대한 서비스 이용제한)\n" to """
① 회원은 제10조에 따른 회원의 의무를 위반하는 행위를 하여서는 안 되며, 해당 행위를 하는 경우에 회사는 다음 각 호의 구분에 따른 회원의 서비스 이용제한, 관련 정보(글, 사진, 영상 등) 삭제 및 기타의 조치를 포함한 이용제한 조치를 할 수 있습니다. 이용제한 조치가 이루어지는 구체적인 사유 및 절차는 제19조 제1항에 따라 개별 게임의 운영정책에서 정합니다.
 1. 일부 권한 제한 : 일정기간 일정 권한을 제한
 2. 계정 이용제한 : 일정기간 또는 영구히 회원 계정의 이용을 제한
 3. 회원 이용제한 : 일정기간 또는 영구히 회원의 서비스 이용을 제한

② 제1항의 이용제한이 정당한 경우에 회사는 이용제한으로 인하여 회원이 입은 손해를 배상하지 않습니다.

③ 회사는 다음 각 호의 사유에 대한 조사가 완료될 때까지 해당 계정의 서비스 이용을 정지할 수 있습니다.
 1. 계정이 해킹 또는 도용당했다는 정당한 신고가 접수된 경우
 2. 불법프로그램 사용자 또는 작업장 등 위법행위자로 의심되는 경우
 3. 그 밖에 각 호에 준하는 사유로 서비스 이용의 잠정조치가 필요한 경우.
    """.trimIndent(),

    "제12조 (이용제한 조치의 사유와 절차) " to """① 회사는 제18조 제1항에 따른 이용제한 조치의 구체적인 사유 및 절차를 제10조 제1항에 따른 금지행위의 내용․정도․횟수․결과 등을 고려하여 운영정책으로 정합니다.

② 회사가 제18조 제1항에서 정한 이용제한 조치를 하는 경우에는 다음 각 호의 사항을 회원에게 사전 통지합니다. 다만, 긴급히 조치할 필요가 있는 경우에는 사후에 통지할 수 있습니다.
 1. 이용제한 조치의 사유
 2. 이용제한 조치의 유형 및 기간
 3. 이용제한 조치에 대한 이의신청 방법
    """.trimIndent(),

    "제13조 (이용제한 조치에 대한 이의신청 절차)" to """① 회원이 회사의 이용제한 조치에 불복하고자 할 때에는 이 조치의 통지를 받은 날부터 14일 이내에 불복 이유를 기재한 이의 신청서를 서면, 전자우편 또는 이에 준하는 방법으로 회사에 제출하여야 합니다.

② 회사는 제1항의 이의신청서를 접수한 날부터 15일 이내에 불복 이유에 대하여 서면, 전자우편 또는 이에 준하는 방법으로 답변합니다. 다만, 회사는 이 기간 내에 답변이 어려운 경우에는 그 사유와 처리일정을 통지합니다.

③ 회사는 불복 이유가 타당한 경우에는 이에 따른 조치를 취합니다."""
)
val agreeBody5 = mapOf(
    "제14조 (손해배상)" to """① 회사 또는 회원은 본 약관을 위반하여 상대방에게 손해를 입힌 경우에는 그 손해를 배상할 책임이 있습니다. 다만, 고의 또는 과실이 없는 경우에는 그러하지 아니 합니다""".trimIndent(),
    "제15조 (회사의 면책)" to """① 회사는 천재지변 또는 이에 준하는 불가항력으로 인하여 서비스를 제공할 수 없는 경우에는 서비스 제공에 관하여 책임을 지지 않습니다.

② 회사는 서비스용 설비의 보수, 교체, 정기점검, 공사 등 기타 이에 준하는 사유로 발생한 손해에 대하여 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.

③ 회사는 회원의 고의 또는 과실로 인한 서비스 이용의 장애에 대하여는 책임을 지지 않습니다. 다만, 회원에게 부득이하거나 정당한 사유가 있는 경우에는 그러하지 아니합니다.

④ 회원이 서비스와 관련하여 게재한 정보나 자료 등의 신뢰성, 정확성 등에 대하여 회사는 고의 또는 중대한 과실이 없는 한 책임을 지지 않습니다.

⑤ 회사는 회원이 다른 회원 또는 타인과 서비스를 매개로 발생한 거래나 분쟁에 대해 개입할 의무가 없으며, 이로 인한 손해에 대해 책임을 지지 않습니다.

⑥ 회사는 무료로 제공되는 서비스 이용과 관련하여 회원에게 발생한 손해에 대해서는 책임을 지지 않습니다. 그러나 회사의 고의 또는 중과실에 의한 경우에는 그러하지 아니합니다.

⑦ 회사는 회원이 서비스를 이용하여 기대하는 이익을 얻지 못하거나 상실한 것에 대하여 책임을 지지 않습니다.

⑧ 회사는 회원이 모바일 기기 비밀번호 등을 관리하지 않아 발생하는 제3자 결제에 대해 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.

⑨ 회원이 모바일 기기의 변경, 모바일 기기의 번호 변경, 운영체제(OS) 버전의 변경, 해외 로밍, 통신사 변경 등으로 인해 콘텐츠 전부나 일부의 기능을 이용할 수 없는 경우 회사는 이에 대해 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.

⑩ 회원이 회사가 제공하는 콘텐츠나 계정정보를 삭제한 경우 회사는 이에 대해 책임을 지지 않습니다. 다만, 회사의 고의 또는 과실에 의한 경우에는 그러하지 아니합니다.""".trimIndent()

)
val agreeTitle = mapOf(
    "제1장 총칙" to agreeBody1,
    "제2장 개인정보 관리" to agreeBody2,
    "제3장 이용계약 당사자의 의무" to agreeBody3,
    "제4장 서비스 이용 및 이용제한" to agreeBody4,
    "제5장 손해배상 및 면책조항 등" to agreeBody5
)

val infoAgree = mapOf(
    "" to """푸릇에이블에 회원가입 신청하시는 분께 수집하는 개인정보의 항목, 개인정보의 수집 및 이용목적, 개인정보의 보관 및 이용기간을 안내 드리오니 자세히 읽은 후 동의하여 주시기 바랍니다.""".trimIndent(),
    "□   개인정보의 항목" to """· 성명, 이메일, 닉네임, 프로필 정보(프로필 사진)""".trimIndent(),
    "□   개인정보의 수집 및 이용목적" to """
   · ‘성명, 이메일, 닉네임’을 필수항목으로 수집합니다.
   서비스 이용 과정에서 ‘프로필 정보(프로필 사진)’을
   이용자로부터 수집합니다.
   · 개인정보의 이용 목적 : 수집된 개인정보를
   푸릇에이블 서비스 이용시에 활용하며, 목적 외의
   용도로는 사용하지 않습니다.
    """.trimIndent(),
    "□   개인정보의 보관 및 이용 기간" to """
   · 푸릇에이블은 원칙적으로 이용자의 개인정보를
   회원 탈퇴 시 지체없이 파기하고 있습니다.
    """.trimIndent(),
    "※  회원은 위와 같은 개인정보의 수집 및 이용을 거부할 수 있습니다. 단, 개인정보의 수집 및 이용에 동의하지 않을 경우 회원가입이 불가합니다." to ""

)