package com.fruitable.Fruitable.app.presentation.data

val notice1 = listOf(
    "푸릇에이블 출시 안내", "2022.11.27",
    "안녕하세요.\n2022년 12월 29일자로 ‘푸릇에이블’이 출시되었습니다.\n\n" +
            "푸릇에이블은 모바일 속에서 신선하고 맛있는 과일과 채소" +
            "를 만나볼 수 있는 24시간 농산물 판매장터입니다.\n\n" +
            "SNS상에서 활동하는 농산물 판매처를 한눈에 확인하고 원하는 농산물을 빠르고 간편하게 만나보세요!\n\n" +
            "푸릇에이블은 정성이 담긴 농산물을 통해 소비자, 판매자 여러분이 연결될 수 있고 또 활발한 소통이 이루어질 수 있도록 노력하겠습니다.\n\n" +
            "감사합니다."
)
val notice2 = listOf(
    "푸릇에이블 1.0.0 버전 안내", "2022.11.27",
        "안녕하세요. 푸릇에이블입니다.\n푸릇에이블 " + "1.0.0 버전에 관해 안내" +
        "드립니다.\n\n[ 내용 ]\n" +
        "- 닉네임 및 비밀번호 입력, 이메일 본인 인증, " +
        "이용약관 동의, 개인정보 수집 및 이용 동의, " +
        "만 14세 이상 동의 후 회원가입 가능 - 로그인 상태에서 서비스 이용 가능\n" +
        "- 전체 게시판 리스트 화면에서 해시태그, 판매게시글 확인\n" +
        "- 판매 게시글을 클릭하여 내용 확인\n" +
        "- 프로필 수정에서 회원 정보 (닉네임, 비밀번호)의 수정 가능\n" +
        "- 설정에서 사용자 설정 ( 계정 정보, 판매자로 등업하기) 및 기타 내용 ( 공지사항, 언어설정, 버전정보) 확인\n" +
        "- 설정에서 로그아웃 및 회원탈퇴 진행"
)
val notice3 = listOf(
    "푸릇에이블 1.1.0 버전 업데이트 안내", "2023.02.14",
    """
        안녕하세요. 푸릇에이블입니다. 
        푸릇에이블 1.1.0버전 안내드립니다. 

        1. 더 많은 기능을 만나보세요!
        - 사용자 쿠키 정보 저장
        - 회원가입 시 이메일 인증 코드 유효기간 설정
        - 전체 게시글 조회 새로고침
        - 카테고리, 해시태그 별 필터링
        - 게시글 수정, 삭제 기능 
        - 상세 게시글 내 주문하기 기능 활성화
        - 전체 게시글 새로고침

        2. 일부 버그를 수정했어요!
        - 서버 접속 실패 시 강제 종료 에러 해결
        - 회원가입, 로그인, 회원정보 수정, 게시글 조회 등 모든 기능 활성화

        3. 사용자 환경을 개선했어요!
        - 로딩 애니메이션 추가 
    """.trimIndent()
)
val notices = listOf(notice3, notice2, notice1)
